plan:
```
  # module.sql-shit.google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "shitsql"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "us-west1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy      = (known after apply)
          + availability_type      = "ZONAL"
          + crash_safe_replication = (known after apply)
          + disk_autoresize        = true
          + disk_size              = 10
          + disk_type              = "PD_HDD"
          + pricing_plan           = "PER_USE"
          + replication_type       = "SYNCHRONOUS"
          + tier                   = "db-f1-micro"
          + version                = (known after apply)

          + backup_configuration {
              + enabled    = true
              + start_time = (known after apply)
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "/projects/<project>/global/networks/default"
            }

          + location_preference {
              + zone = "us-west1-b"
            }
        }
    }
```
outcome:
```
Error: Error, failed to create instance shitsql: googleapi: Error 400: Invalid request: Project <project> has invalid private network name /projects/<project>/global/networks/default., invalid

  on modules/postgresql/main.tf line 8, in resource "google_sql_database_instance" "instance":
   8: resource "google_sql_database_instance" "instance" {
```
upon removing the first "/", the instantiation works as expected